{"sections":{"main":{"type":"emma-page","settings":{"show_image":false}},"mattress":{"type":"page-mattress","blocks":{"1ab89918-c9d7-4a34-96ab-74b93c03f954":{"type":"slide","settings":{"header":"Twin","subtitle":"<p>Recommended for: single sleepers or children\/ teenagers<\/p>","body":"<p>Twin bed mattresses have dimensions of 38in x 75in, or 3’x 6’3”. This size is perfect for children or teenagers, as this mattress size offers enough space for single sleepers. Twin bed mattresses are a common mattress size for bunk beds, but are also a great option if you have a small bedroom and need space to fit in other furniture.<\/p>","image":"shopify:\/\/shop_images\/Twin.png"}},"2777d010-487a-4ee2-b56d-cb72fbfb002a":{"type":"slide","settings":{"header":"Twin XL","subtitle":"<p>Recommended for: single sleepers, who need more leg space<\/p>","body":"<p>Twin XL mattresses have dimensions of 38in x 80in or 4’x6’3”. This size is great for bedrooms that aren’t quite large enough to fit a double bed. Twin XL mattresses offer an ideal amount of space for single sleepers to comfortably stretch out, perfect for the taller members of your family. For good context, it's perfect for guest rooms.<\/p>","image":"shopify:\/\/shop_images\/Twin_XL.png"}},"cb2c164a-b8e3-4e73-acad-71a75f006405":{"type":"slide","settings":{"header":"Full","subtitle":"<p>Recommended for: a good option for couples with small to medium size rooms<\/p>","body":"<p>The dimensions of 54in x 75in or 4’6” and 6’3” mean that this mattress size is spacious enough to fit two sleepers. It also allows single sleepers to fully stretch out. Full size mattresses can fit in most standard bedrooms, without taking up too much space. So, it’s a great option for master bedrooms.<\/p>","image":"shopify:\/\/shop_images\/Full.png"}},"d322df70-7e8a-455e-8f1c-f4927ff670e8":{"type":"slide","settings":{"header":"Queen","subtitle":"<p>Recommended for: couples who like more space or who are taller<\/p>","body":"<p>With dimensions of 60in x 80in or 5’0” x 6’ 8” queen size mattresses offer a large amount of space. They are a great option for couples, as there is enough room for both partners to sleep comfortably. The longer length also means that this mattress size is great for taller people who might find smaller mattress sizes not spacious enough. King size mattresses tend to take up a bit of space, so this size is best for larger bedrooms.<\/p>","image":"shopify:\/\/shop_images\/Queen.png"}},"57537c74-60d0-4e4f-bca1-a2598e9e3df8":{"type":"slide","settings":{"header":"King","subtitle":"<p>Recommended for: couples who like their own space or are taller<br\/><\/p>","body":"<p>King size mattresses offer a luxurious amount of sleeping space. The dimensions of 76in x 80in or 6’4” x 6’8” mean that this mattress size is perfect for couples who like their own space. It is also a great option for families who like to spend their Sunday mornings together in bed. King mattresses are considerably wider than the standard Full bed mattress and require a large amount of space.<\/p>","image":"shopify:\/\/shop_images\/King.png"}}},"block_order":["1ab89918-c9d7-4a34-96ab-74b93c03f954","2777d010-487a-4ee2-b56d-cb72fbfb002a","cb2c164a-b8e3-4e73-acad-71a75f006405","d322df70-7e8a-455e-8f1c-f4927ff670e8","57537c74-60d0-4e4f-bca1-a2598e9e3df8"],"settings":{"mattress_image":"shopify:\/\/shop_images\/Mattress_Sizes.png"}}},"order":["main","mattress"]}